Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ལ་ཞབས་གཅིག་གིས་རེག་པར་མཛད་དོ། །
en: The Blessed One then touched that galaxy of a thousand worlds with one foot.

source: དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་མ་རེག་ཙམ་དུ་ཉེ་བར་འདུག་སྟེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་བསྲུང་དུ་གསོལ།
en: Just as the Blessed One was about to touch the ground, however, the whole assembly seated nearby cried out, “Blessed One, keep us safe!

source: བདེ་བར་གཤེགས་པ་བདག་ཅག་བསྐྱབ་ཏུ་གསོལ།
en: Sublime One, protect us!

source: བདག་ཅག་ལ་གནོད་ལགས་སོ། །
en: We are in danger!

source: བདག་ཅག་ལ་རབ་ཏུ་གནོད་ལགས་སོ། །
en: We are in great danger!

source: བདག་ཅག་འདར་པད་པད་ལགས་སོ། །
en: We are trembling!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་མ་འཇིགས་ཤིག །མ་འཇིགས་ཤིག །
en: The Blessed One said, “Have no fear, friends, have no fear.

source: དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་གི་ཡུལ་ནི་འདི་ལྟ་སྟེ། ས་ཆེན་པོ་འདི་རབ་ཏུ་གཡོས་པ་དང་།
en: This is the impact of these words of the mantra, which have been authorized by the empowering authority of the Realized One: the great earth quakes;

source: རྒྱ་མཚོ་ཆེན་པོ་འཁྲུགས་པ་དང་།
en: the great ocean roils.

source: ཁྱེད་ཀྱང་ནམ་མཁའ་ལ་གནས་ནས་རབ་ཏུ་གཡོས་པ་ཡིན་ནོ། །
en: Even if you were in the sky, you would quake.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་འཁོར་གྱི་ཁྱམས་སུ་ཅི་ནས་སྲོག་ཆགས་བརྒྱད་ཁྲིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། སེམས་ཅན་ཚད་མེད་པ་དེ་དག་གིས་བསླབ་པའི་གནས་རྣམས་བླངས་པར་གྱུར་པ་དེ་ལྟར་ཆོས་རྒྱ་ཆེར་བསྟན་ནོ།། །།
en: The Blessed One then taught the Dharma at length so that eighty thousand beings in the courtyard of Vajrapāṇi, Lord of the Guhyakas, conceived the aspiration for awakening and an immeasurable number of beings took up the basic moral precepts.

source: བམ་པོ་དགུ་པ། དེ་ནས་གསང་བ་པའི་བདག་པོའི་བུ་རྡོ་རྗེའི་སྡེས་བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེའི་དྲ་བས་མངོན་པར་བཀབ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་མི་འཁྲུགས་པའི་ཆོས་ཅན་དུ་འགྱུར་བ་ལགས།
en: Vajrasena, son of the Lord of the Guhyakas, then covered the Blessed One with a net of jewels and inquired of the Blessed One, “How is it, Blessed One, that bodhisattvas become unshakable in their resolve for unsurpassable and perfect awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཅུ་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་མི་འཁྲུགས་པའི་ཆོས་ཅན་དུ་འགྱུར་རོ། །
en: The Blessed One answered, “Noble son, bodhisattvas of great courage who have ten qualities become unshakable in their resolve for unsurpassable and perfect awakening.

source: ཁོང་ཁྲོ་བ་མེད་པའི་བྱམས་པ་ཆེན་པོ་དང་།
en: They are great love without anger;

source: ཡོངས་སུ་མི་སྐྱོ་བའི་སྙིང་རྗེ་ཆེན་པོ་དང་།
en: great compassion without weariness;

source: བརྩམས་པ་ཐམས་ཅད་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའི་བརྩོན་འགྲུས་དང་།
en: heroic effort that brings to completion everything one has begun;

source: སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་སྦྱོར་བའི་ཏིང་ངེ་འཛིན་དང་།
en: concentration that is brought into contact with emptiness;

source: མངོན་སུམ་དུ་རྟོགས་པའི་ཤེས་རབ་དང་།
en: wisdom that is perceived with one’s own eyes;

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་མཁས་པ་དང་།
en: all-encompassing expertise;

source: དུས་གསུམ་ཡོངས་སུ་སྦྱོང་བའི་ཡེ་ཤེས་དང་།
en: knowledge that cleanses the three times;

source: བདེན་པ་མཐོང་བ་སྦྱང་བར་བྱ་བ་སྒྲིབ་པ་མེད་པ་དང་།
en: vision of the truths that is not obscured by any smudges;

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་སྟོང་པ་ཉིད་དང་།
en: being endowed with emptiness, which is the finest of all qualities;

source: ཇི་ལྟ་བ་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ལམ་ལ་འཇུག་པ་སྟེ།
en: and having set out upon the path of what is entirely pure just as it is.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་མི་འཁྲུགས་པའི་ཆོས་ཅན་དུ་འགྱུར་རོ། །
en: Young one, bodhisattvas who have these ten qualities become unshakable in their resolve for unsurpassable and perfect awakening.”

source: གསང་བ་པའི་བདག་པོའི་བུ་རྡོ་རྗེའི་སྡེས་བཅོམ་ལྡན་འདས་ལ་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ཐོས་ན་མི་དངང་མི་སྐྲག་ཅིང་སྐྲག་པར་མི་འགྱུར་བ་ལགས།
en: Vajrasena, son of the Lord of the Guhyakas, then spoke again to the Blessed One: “How is it, Blessed One, that bodhisattvas can avoid feeling fear, fright, or terror when they hear about the inconceivable qualities of a buddha?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ཐོས་ན་མི་དངང་མི་སྐྲག་ཅིང་སྐྲག་པར་མི་འགྱུར་ཏེ། བརྒྱད་གང་ཞེ་ན། ཤེས་རབ་ཀྱིས་བརྟན་པ་ཡིན། ཡེ་ཤེས་ཀྱིས་བརྟན་པ་ཡིན།
en: The Blessed One answered, “Young one, bodhisattvas who have eight qualities do not become fearful, frightened, or terrified when they hear about the inconceivable qualities of a buddha.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་ཡིན།
en: What are these eight qualities?

source: རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡིན། སྒྱུ་མ་དང་མཚུངས་པའི་ཆོས་ལས་ངེས་པར་འབྱུང་བ་ཡིན། ཆོས་ལ་མི་རྟག་པར་མོས་པ་ཡིན། སེམས་ནམ་མཁའ་དང་མཚུངས་པ་ཡིན། ཆོས་ཐམས་ཅད་རྣམ་པར་བསྒྲུབས་པར་གནས་པའི་མཚན་ཉིད་དུ་ཤེས་པ་ཡིན་ཏེ།
en: They are steadiness due to one’s wisdom, steadiness due to one’s knowledge, being held firmly by companions in what is good, having lofty aspirations, letting go of things that have the characteristics of a magical illusion, having an interest in the idea that things are impermanent, having a mind that is equal to space, and knowing that all things have the characteristic of being involved in a magical creation.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ཐོས་ན་མི་དངང་མི་སྐྲག་ཅིང་སྐྲག་པར་མི་འགྱུར་རོ། །གསོལ་པ།
en: Young one, bodhisattvas who have these eight qualities do not become fearful, frightened, or terrified when they hear about the inconceivable qualities of a buddha.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་བགྱི་བ་ཐམས་ཅད་ལ་དབང་དང་ལྡན་པར་འགྱུར་བ་ལགས།
en: “With what qualities should bodhisattvas be equipped, Blessed One, so that they gain the power to do everything that should be done?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བྱ་བ་ཐམས་ཅད་ལ་དབང་དང་ལྡན་པར་འགྱུར་ཏེ།
en: The Blessed One answered, “Young one, bodhisattvas equipped with four qualities gain the power to do everything that should be done.

source: ལེགས་པར་བསྒོམས་ཤིང་ཉམས་པར་མ་གྱུར་པའི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཡིན།
en: They have thoroughly cultivated and become equipped with the five supernormal faculties without any impairment.

source: རྣམ་པར་ཐར་པའི་སྒོས་ཡོངས་སུ་བསྒོས་པའི་བསམ་གཏན་བཞི་དང་ལྡན་པ་ཡིན།
en: They are equipped with the four states of meditation that are fully pervaded by the gateway to liberation.

source: ཚངས་པའི་བླ་མ་འཇིག་རྟེན་ལས་འདས་པའི་ཚངས་པའི་གནས་པ་བཞི་དང་ལྡན་པ་ཡིན།
en: They are equipped with the four dwellings of Brahmā, which transcend even the highest Brahmā world.

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་རྣམ་པར་རྒྱུ་བའི་ཐབས་དང་ཤེས་རབ་ལས་ངེས་པར་བྱུང་བ་ཡིན་ཏེ།
en: They are masters of wisdom and skill in means, which apply to every situation.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱ་བ་ཐམས་ཅད་ལ་དབང་དང་ལྡན་པར་འགྱུར་རོ། །
en: Young one, bodhisattvas equipped with these four qualities gain the power to do everything that should be done.”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒོ་དུ་མཆིས།
en: “What are the gateways of the bodhisattvas, Blessed One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒོ་བཞི་སྟེ།
en: The Blessed One answered, “Young one, there are four gateways of the bodhisattvas.

source: འདི་ལྟ་སྟེ། སེམས་ཅན་གྱི་དབང་པོ་ལ་འཇུག་པ་ཡེ་ཤེས་ཀྱི་སྒོ་དང་།
en: They are as follows: the gateway of knowledge, which comprehends the spiritual faculties of beings;

source: ཚིག་རབ་ཏུ་དབྱེ་བ་བསྟན་པ་ཤེས་རབ་ཀྱི་སྒོ་དང་།
en: the gateway of wisdom, which teaches the fine analysis of words;

source: སྐད་ཐམས་ཅད་ཀུན་ཏུ་འཛིན་པ་ལ་འཇུག་པ་གཟུངས་ཀྱི་སྒོ་དང་།
en: the gateway of powerful memory and the formulas that support it, which enables a thorough grasp of all languages;

source: ཆོས་མི་ཟད་པ་བསྟན་པ་སོ་སོ་ཡང་དག་པར་རིག་པའི་སྒོ་སྟེ།
en: and the gateway of the special modes of knowledge, which teaches the inexhaustible Dharma.

source: གཞོན་ནུ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒོའོ། །གསོལ་པ།
en: Young one, these are the four gateways of the bodhisattvas.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་དུ་མཆིས།
en: “What are the powers of the bodhisattvas, Blessed One?’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ནི་དགུ་སྟེ།
en: The Blessed One answered, “Young one, there are nine powers of the bodhisattvas.

source: དགུ་གང་ཞེ་ན།
en: What are these nine powers?

source: སྙིང་རྗེ་བར་བྱ་བའི་ཕྱིར་ངེས་པར་སེམས་པའི་སྟོབས་དང་།
en: They are the power of profound contemplation so that one may do the work of compassion;

source: ཕྱིར་མི་ལྡོག་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་།
en: the power of heroic courage so that one may become impossible to turn back from awakening;

source: ཤེས་རབ་ཆེན་པོར་བྱ་བའི་ཕྱིར་ཐོས་པའི་སྟོབས་དང་།
en: the power of learning so that one may develop great wisdom;

source: རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་མོས་པའི་སྟོབས་དང་།
en: the power of ardent devotion so that one may fulfill the goal of liberation;

source: འབྲལ་བར་བྱ་བའི་ཕྱིར་བསྒོམ་པའི་སྟོབས་དང་།
en: the power of cultivation so that one may become free;

source: སེམས་བསྲུང་བའི་ཕྱིར་བཟོད་པའི་སྟོབས་དང་།
en: the power of patience in order to protect the mind;

source: བདུད་ཚར་གཅད་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་སྟོབས་དང་།
en: the power of the aspiration for awakening in order to gain power over Māra;

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་དང་།
en: the power of great compassion so that one may bring beings to maturity;

source: སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་མི་སྐྱེ་བར་བཟོད་པའི་སྟོབས་ཏེ།
en: and the power of acceptance of the fact that things do not arise so that one may gain full possession of the ten powers of the realized ones.

source: གཞོན་ནུ་དགུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་སོ། །
en: Young one, these are the nine powers of the bodhisattvas.”

source: བསྟན་པ་འདི་བཤད་པ་ན་གསང་བ་པའི་བདག་པོའི་བུ་དེ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏེ། དེ་དག་བཟོད་པ་ཐོབ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གསང་བ་པའི་བདག་པོའི་གནས་སུ་ཡུན་རིང་དུ་གནས་ཤིང་སྤྱོད་པར་འགྱུར་བ་དང་།
en: When this teaching had been given, the sons of the Lord of the Guhyakas gained acceptance of the fact that things do not arise, and once they had gained acceptance of this fact they implored the Blessed One, “Use your empowering authority, Blessed One, to ensure that this formulation of the Dharma continues to exist and be circulated for a long time in the abode of the Lord of the Guhyakas.

source: སེམས་ཅན་སྣོད་དུ་གྱུར་པ་དེ་དག་གི་རྣ་ལམ་དུ་གྲག་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སླད་ན་འཛམ་བུའི་གླིང་དུ་རྒྱས་པར་འགྱུར་ཞིང་ཅི་ནས་ཀྱང་ནུབ་པར་མི་འགྱུར་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: Ensure that those beings who are worthy recipients of it will continue to hear of it, that it will spread widely throughout Jambudvīpa, and that by no means will it disappear after the complete cessation of the Realized One.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོའི་བུ་དེ་དག་གིས་གསོལ་བ་བཏབ་པར་མཁྱེན་ནས། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་འདི་ལྟ་སྟེ། དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་བྱ་བ་དང་། བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅད་པར་བྱ་བའི་ཕྱིར་ངས་ཁྱོད་ལ་བསྐུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་པ་བསྲུང་བ་དང་། བདུད་ཀྱི་སྡེ་འོངས་པ་ན་བདུད་ཚར་གཅད་པའི་ཕྱིར་ཁྱོད་ཀྱིས་གསང་སྔགས་ཀྱི་ཚིག་གང་དག་བསམས་ཤིང་བརྗོད་པ་དང་། ཁ་ཏོན་བྱས་པ་དེ་དག་ལ་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །
en: Thinking of what the sons of the Lord of the Guhyakas had requested of him, the Blessed One said to Vajrapāṇi, Lord of the Guhyakas, “So that the way of the true Dharma continues to exist for a long time and the māras and proponents of other doctrines are defeated in accordance with the Dharma, I request you, Lord of the Guhyakas, to speak the words of the mantra that you called to mind and then expressed and intoned in order to protect the Bodhisattva when he was seated at the supreme point of the seat of awakening and to defeat the māras when the armies of Māra had come there.”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱིས་བསྐུལ་བར་རིག་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། དེའི་ཚེ་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་སོ། །ཏདྱ་ཐཱ། ཧུ་ལུ་ཧུ་ལུ། ཧུ་ལེ་དྷི་རེ། ཧ་རི་ཏི། ཨ་ཀུ་ཤ་ལ་ཀྵ་ཡེ། ཙ་ལེ། ཙ་ལ་བ་ཏི། སཱ་རེ། ཀྵུ་རེ་ཀྵཱན་ཏི་བ་ལེ། ཀྵེ་མེ། ཤཱན་ཏི་ཀ་རེ། ཀྵ་མེ། ཤ་མེ། ཧུ་ལུ། ཨི་ལི་ཁི། ཁི་རེ། ཁ་རེ། ཨ་བེ་ཤ་ནི། ས་ར་ཎེ། ཛ་ཡེ། ཛ་ཡ་བ་ཏི། སྠི་རེ། ཨཱ་བརྟེ། བི་བརྟེ། ཨཱ་བརྟ་ནི། མཻ་ཏྲེ། བྷུ་ཏ་ནཱན། སད་གྲ་ཧེ། ད་མེ། ད་མ་སམ་པན་ནེ། ཏཱ་ར་ཎེ།
en: Understanding the Blessed One’s request, Vajrapāṇi, Lord of the Guhyakas, then rose from his seat, arranged his cloak over one shoulder , knelt down on his right knee, and bowing toward the Blessed One with his arms outstretched, palms together in a gesture of salutation, he spoke the words of the mantra:

source: ཏཱ་ར་ཡ་སེ་སྭ་ཡན། སྭ་སྟི་དེ་བེ་བྷྱོ། ནཱ་གེ་བྷྱོ། ཡཀྵེ་བྷྱོ། གན་དྷརྦེ་བྷྱོ། རཱཀྵ་སེ་བྷྱོ།
en: tadyathā | hulu hulu | hule dhire | hariti | akuśalakṣaye | cale | calavati | sāre | kṣure kṣāntivale | kṣeme | śāntikare| kṣame | śame | hulu | ilikhi | khire | khare | aveśaṇi | saraṇe | jaye | jayavati | sthire | āvarte | vivarte | āvartani | maitre | bhutanān | sanggrahe | dame | damasampanne | tāraṇe | tārayasesvayan | svasti devebhyo | nāgebhyo | yakṣebhyo | gandharvebhyo | rākṣasebhyo | manuṣebhyo | amanuṣebhyo | svastir bhavatu sadāmukham | |

source: མ་ནུ་ཥེ་བྷྱོ། ཨ་མ་ནུ་ཥེ་བྷྱོ། སྭ་སྟིར་བྷ་བ་ཏུ་ས་དཱ་མུ་ཁ་མ། གསང་སྔགས་འདི་དག་རབ་བརྗོད་པས། །
en: The recitation of the words of the mantra

source: རི་ཡི་རྒྱལ་པོ་རྣམས་ཀྱང་གཡོས། །
en: Shook even the king of mountains;

source: ས་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར། །
en: It made the earth quake, too,

source: ཆུ་ཡི་རྒྱལ་པོ་རྣམས་ཀྱང་འཁྲུགས། །
en: And it also made the king of waters roil.

source: གསང་སྔགས་འདི་དག་རབ་བརྗོད་པས། །
en: The recitation of the words of the mantra

source: ཕས་ཀྱི་རྒོལ་རྣམས་ཚར་ཡང་གཅོད། །
en: Defeated the proponents of other doctrines,

source: ཆོས་སྨྲ་བ་ན་ཡང་དག་བསྡུས། །
en: Brought together the exponents of the Dharma,

source: ཆོས་ཀྱི་མཛོད་ནི་ཀུན་ཏུ་བསྲུངས། །
en: And safeguarded the treasury of the Dharma.

source: གསང་སྔགས་གཞི་འདི་ཐོས་ནས་ནི། །
en: When they heard the words of the mantra

source: ལྷ་ཚོགས་ཀུན་ཏུ་དགའ་གྱུར་ནས། །
en: The groups of gods were overjoyed, And each one of them stated the wish,

source: དམ་ཆོས་རིང་དུ་གནས་འགྱུར་ཞེས། །ཕན་ཚུན་དུ་ནི་སྨྲ་བར་བྱེད། །
en: “May the true Dharma last a long time.”

source: སྟོང་གསུམ་པོ་ཡང་རབ་ཏུ་གཡོས། །
en: As the cosmos of a billion worlds shook,

source: འཁོར་ཡང་རབ་ཏུ་འདར་གྱུར་ནས། །
en: The assembly, too, began to tremble.

source: མི་ཡི་དབང་པོའི་ཞབས་གཉིས་ལ། །
en: They touched the feet of the Lord of Men,

source: གཏུག་པ་བྱས་ཏེ་སྐྱབས་སུ་དོང་། །
en: To whom they had gone for protection.

source: དེ་དག་མི་འཇིགས་དེར་བྱིན་ནས། །
en: They had gone to the one without fear,

source: སྟོན་པས་འདི་སྐད་བཀའ་སྩལ་ཏེ། །
en: The Teacher, who had spoken thus,

source: མདོ་འདི་བྱིན་གྱིས་བརླབས་པས་ན། །
en: Whose authority empowered this discourse,

source: དམ་ཆོས་རིང་དུ་གནས་པར་འགྱུར། །
en: Ensuring that the true Dharma would last long.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་སུ་ཞག་བདུན་འདས་འདས་སུ་སེམས་ཅན་ཚད་མེད་པ་དག་གི་དོན་མཛད་ནས་ཞག་བདུན་འདས་ཏེ། ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་སེམས་ཅན་གྱི་དོན་མཛད་པ་ཇི་སྙེད་པ།
en: The Blessed One then spent seven days in the abode of Vajrapāṇi, Lord of the Guhyakas, and for seven days he fulfilled the wishes of limitless beings.

source: དེ་དག་ཐམས་ཅད་རྒྱས་པར་མཛད་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ནས་གཤེགས་ཏེ།
en: As many different wishes as the beings had in that assembly in the capital city of Aḍagavatī, he fulfilled them all.

source: ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་དེ་ཉིད་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ནི་བསྐོར། ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་ནི་མདུན་དུ་བདར། ལྷའི་ཚོགས་ཀྱིས་ནི་ཕྱག་བྱས།
en: Then the Blessed One left the abode of Vajrapāṇi, Lord of the Guhyakas, and, surrounded by the host of bodhisattvas and accompanied by the host of disciples, he flew freely through the vault of the sky like the king of swans, as a host of gods paid homage to him;

source: ལྷའི་བུ་མོའི་ཚོགས་ཀྱིས་ནི་མངོན་པར་བསྟོད།
en: a host of goddesses praised him;

source: གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དུ་མས་ནི་བསྐོར། བརྒྱ་བྱིན་དང་།
en: yakṣas, gandharvas, asuras, and garuḍas surrounded him;

source: ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱིས་ནི་མངོན་པར་བསྟོད།
en: and Śakra, Brahmā, and the Lokapālas offered him praise.

source: འོད་ཟེར་གྱི་དྲ་བ་ནི་རབ་ཏུ་འགྱེད། རོལ་མོ་སིལ་སྙན་ནི་ལེན། མེ་ཏོག་གི་ཆར་ནི་འབེབས། ཞིང་རྣམས་ནི་རབ་ཏུ་གཡོ་བར་མཛད་ཅིང་སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་།
en: The rays of light they emitted made a latticework of light, as musical instruments were played, it rained down showers of flowers, and all the domains trembled.

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་དཔལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་གཟི་བརྗིད་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་ཆེན་པོ་དང་།
en: All this was due to the great majestic power of the Buddha, the great superhuman power of the Buddha, the great transformative power of the Buddha, the great miraculous display of the Buddha, the great glory of the Buddha, the great vital energy of the Buddha, the great demeanor of the Buddha, and the great child’s play of the Buddha.

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པ་ཆེན་པོས་ངང་པའི་རྒྱལ་པོ་ལྟར་ཐོགས་པ་མེད་པར་གཤེགས་ཏེ། སླར་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བྱོན་ཏོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲངས་པར་གྱུར་ཏོ། །
en: With Vajrapāṇi, Lord of the Guhyakas, following as his attendant, the Blessed One returned to the hill, Vulture Peak.

source: བཞུད་པ་དང་བྱོན་པའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་པའོ།། །།
en: This was the twentieth chapter, “Going and Coming.” Chapter 21: On Śūrabala

source: དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཞུགས་སོ། །
en: At that point, the Blessed One remained at the hill, Vulture Peak, together with the bodhisattvas and great disciples.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་ཆོས་སྟོན་ཏོ། །
en: The Blessed One rested in the afternoon and then he got up and taught the Dharma.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྲོག་ཆགས་དྲུག་ཁྲི་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འཁོར་དང་བཅས་པས། བཅོམ་ལྡན་འདས་སླར་གཤེགས་པར་རིག་ནས་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་།
en: Then the sixty thousand inhabitants of the great city of Rājagṛha, including King Ajātaśatru and his household, came to know that the Blessed One had returned.

source: བྱུག་པ་ཐོགས་ཏེ། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རིག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: So in the afternoon they took flowers, incense, garlands, and scented oils, left the great city of Rājagṛha and came to the hill, Vulture Peak, and into the presence of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: They bowed their heads at the Blessed One’s feet and sat to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཀྱང་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: As they were sitting to one side, King Ajātaśatru spoke to the Blessed One.

source: བཅོམ་ལྡན་འདས་བདག་འདི་ན་འདུན་ཁང་ན་མཆིས་མཆིས་ན། གཞོན་ནུ་འཇིགས་བྱེད་སྦྱིན་མཆིས་ཏེ་འདི་སྐད་ཅེས་མཆིའོ། །ཡབ་བཅོམ་ལྡན་འདས་ནི་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གདུགས་ཚོད་གསོལ་ནས་སླར་གཤེགས་ཞེས་གདའོ་ཞེས་མཆི་ནས། བཅོམ་ལྡན་འདས་དེ་ལ་བདག་གིས་འདི་སྙམ་དུ་བསམས་ཏེ།
en: “Blessed One,” he said, “I was sitting in my assembly hall, and my son, Given by the Frightful One, was there, too, and he said to me, ‘Father, I heard that the Blessed One had a meal in the capital city of Aḍagavatī in the abode of Vajrapāṇi, Lord of the Guhyakas, and now he has returned.’ Regarding this, Blessed One, I had the following thought:

source: གང་གི་སླད་དུ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་བཅོམ་ལྡན་འདས་སྤྱན་དྲངས་ན་ཡང་།
en: “ ‘For what reason was the Blessed One invited to the capital city of Aḍagavatī in the abode of Vajrapāṇi, Lord of the Guhyakas?

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་སླད་དུ་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གཤེགས་པས། འདི་ལྟར་གང་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་བཏང་བའི་སེམས་ཅན་དེ་ནི་སེམས་ཅན་གྱི་རིས་ན་གང་ཡང་མ་མཆིས་ཏེ།
en: He must have gone to the capital city of Aḍagavatī in order to bring beings there to maturity, because there is no class of beings that is abandoned by the realized ones.

source: སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་པ་ནི་ངོ་མཚར་ཏོ། །
en: The application of the blessed buddhas’ great compassion to those beings is marvelous!

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཆོས་རྣམ་པར་ངེས་པ་ལུང་བསྟན་པ་ལུང་སྟོན་པས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་དགའ་བར་གྱུར་བའི་བདག་ཉིད་ཆེན་པོ་ནི་ངོ་མཚར་ཏོ་སྙམ་བགྱིད་དོ། །
en: By making a prediction of Vajrapāṇi’s determination for the Dharma, the Realized One has delighted the Lord of the Guhyakas. The Blessed One’s greatness of self is marvelous!’

source: བཅོམ་ལྡན་འདས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་ན་དེས་འདི་འདྲ་བའི་སྤོབས་པ་དང་ལྡན་པར་གྱུར།
en: “In the company of how many realized ones, worthy ones, fully awakened buddhas has Vajrapāṇi, Lord of the Guhyakas, cultivated roots of virtue, Blessed One, so that he now possesses such inspired eloquence?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་སེམས་ཅན་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ཀྱིས་ནི་གནས་འདི་ལ་མོས་པར་དཀའ་སྟེ།
en: This is what he said, and the Blessed One then responded to King Ajātaśatru, “Great King, it is difficult for beings who have not developed the roots of virtue to take an interest in this matter.

source: འོན་གྱིས་ཀྱང་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་པ་དེ་དག་ནི་མོས་པར་འགྱུར་རོ། །
en: However, those who have developed the roots of virtue could take an interest in it.

source: རྒྱལ་པོ་ཆེན་པོ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ནི་བགྲང་བའི་ཚུལ་གྱིས་མཐའ་རྟོགས་པར་ནུས་ཀྱི།
en: Great King, it is possible to comprehend an endpoint to the number of worlds throughout the ten directions, which are equal in number as the grains of sand in the Ganges, by doing a calculation.

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་ལ་མཆོད་པ་དང་བསྙེན་བཀུར་བྱས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ནི་བགྲང་བའི་ཚུལ་གྱིས་མཐའ་རྟོགས་པར་མི་ནུས་ཏེ།
en: However, it is not possible to comprehend, by doing a calculation, an endpoint to the number of blessed buddhas worshiped and served by Vajrapāṇi, Lord of the Guhyakas.

source: དེ་དག་གི་གན་ནས་ཚངས་པར་སྤྱད་པ་སྤྱོད་པས་དེས་ན་སྤོབས་པ་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: He has come to possess such inspired eloquence by leading the holy life in their vicinity.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ། རྒྱ་ཆེ་བའི་ཡང་ཆེས་རྒྱ་ཆེ་བ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་མ་སྨད་པ་ཞེས་བྱ་བའི་བསྐལ་པ་ལ།
en: “It is in this fashion, Great King, that you should understand the following: Once upon a time, Great King, in a past eon, going back an incalculable eon, going back more than an incalculable eon, going back a limitless, inconceivable, and immeasureable span of time, there was an eon called Irreproachable.
